<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--Converted with LaTeX2HTML 2002-2-1 (1.70)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy for Linux/x86 (vers 1st September 2004), see www.w3.org" />
<title>Anfangs- und Randbedingungen</title>
<meta name="description" content="Anfangs- und Randbedingungen" />
<meta name="keywords" content="kap_9" />
<meta name="resource-type" content="document" />
<meta name="distribution" content="global" />
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link id="cssstyle" rel="stylesheet" href="../sonder/bron.css" type="text/css" />
<link rel="next" href="node115.html" />
<link rel="previous" href="node113.html" />
<link rel="up" href="node112.html" />
<link rel="next" href="node115.html" />
<script src="../sonder/bron.js" type="text/javascript"></script>
</head>
<body>
<div class="navigation">
<p id="nav1">
<span id="nav1r"><a href="../sonder/inhalt.html">Inhalt</a> <a id="index" href="../index_os/main.html">Index</a></span>
<span id="nav1l"><a id="dtb" href="../sonder/dt_bron.html">DeskTop Bronstein</a></span>
</p>
<p id="nav2">
<span id="nav2r"><a id="prev" href="node113.html"><img src="../icons/prev.png" alt="Zurück" /></a><a id="next" href="node115.html"><img src="../icons/next.png" alt="Zurück" /></a></span>
<span id="nav2l"><a class="kap" href="kap_9.html">Differentialgleichungen</a> <a href="node72.html">Partielle Differentialgleichungen</a> <a href="node111.html">Partielle Differentialgleichungen aus Naturwissenschaft und Technik</a> <a id="up" href="node112.html">Problemstellungen und Randbedingungen</a> </span>
</p>
</div>
<h4><a name="SECTION00823120000000000000" id="SECTION00823120000000000000"></a> <a name="4723"></a> <a name="4724"></a> <a name="4725"></a>
Anfangs- und Randbedingungen</h4>
<p>Die L&ouml;sung physikalischer, technischer und naturwissenschaftlicher Probleme erfordert gew&ouml;hnlich die Erf&uuml;llung zweier grunds&auml;tzlicher Anforderungen:</p>
<ol>
<li>
<div>Die gesuchte L&ouml;sung hat nicht nur der Differentialgleichung zu gen&uuml;gen, sondern zus&auml;tzlich noch Anfangs- bzw. Randbedingungen. Dabei k&ouml;nnen Probleme auftreten, bei denen nur Anfangsbedingungen, nur Randbedingungen oder sowohl Anfangs- als auch Randbedingungen vorgegeben sind. Die Gesamtheit aller Bedingungen mu&szlig; die L&ouml;sung der Differentialgleichung eindeutig festlegen.</div>
</li>
<li>
<div>Die gesuchte L&ouml;sung mu&szlig; gegen&uuml;ber kleinen &Auml;nderungen der Anfangs- und Randbedingungen stabil sein, d.h. sich beliebig wenig &auml;ndern, wenn die &Auml;nderungen dieser Bedingungen, oft auch <span class="begriff">St&ouml;rungen</span> genannt, hinreichend klein sind. Man sagt dann, da&szlig; eine <span class="begriff">korrekte Problemstellung</span> vorliegt.</div>
</li>
</ol>
Erst wenn diese Bedingungen erf&uuml;llt sind, kann davon ausgegangen werden, da&szlig; das mathematische Modell des gegebenen Problems zur Beschreibung realer Erscheinungen geeignet ist.<br />
Bei den Differentialgleichungen des hyperbolischen Typs, auf die besonders Untersuchungen von Schwingungsvorg&auml;ngen in kontinuierlichen Medien f&uuml;hren, ist z.B. das C<small>AUCHY</small>sche Problem korrekt gestellt. Dies bedeutet, da&szlig; auf einer Anfangsmannigfaltigkeit, d.h. auf einer Kurve oder Fl&auml;che, Werte der zu bestimmenden Funktion sowie ihrer Ableitungen in einer nichttangentialen, besonders der Normalenrichtung gegeben sind. Bei den Differentialgleichungen des elliptischen Typs, auf die besonders Untersuchungen von station&auml;ren Vorg&auml;ngen und von Gleichgewichtsproblemen in kontinuierlichen Medien f&uuml;hren, ist die Stellung des Randwertproblems, d.h. die Vorgabe der Werte der zu bestimmenden Funktion auf dem Rande des betrachteten Variabilit&auml;tsgebiets der unabh&auml;ngigen Variablen, korrekt. Wenn das betrachtete Gebiet unbegrenzt ist, dann m&uuml;ssen von der zu bestimmenden Funktion geeignete Verhaltenseigenschaften beim unbegrenzten Wachstum der unabh&auml;ngigen Variablen gefordert werden.
</body>
</html>
