<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--Converted with LaTeX2HTML 2002-2-1 (1.70)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy for Linux/x86 (vers 1st September 2004), see www.w3.org" />
<title>N&auml;herungsmethoden</title>
<meta name="description" content="N&auml;herungsmethoden" />
<meta name="keywords" content="kap_9" />
<meta name="resource-type" content="document" />
<meta name="distribution" content="global" />
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link id="cssstyle" rel="stylesheet" href="../sonder/bron.css" type="text/css" />
<link rel="previous" href="node109.html" />
<link rel="up" href="node95.html" />
<link rel="next" href="node111.html" />
<script src="../sonder/bron.js" type="text/javascript"></script>
</head>
<body>
<div class="navigation">
<p id="nav1">
<span id="nav1r"><a href="../sonder/inhalt.html">Inhalt</a> <a id="index" href="../index_os/main.html">Index</a></span>
<span id="nav1l"><a id="dtb" href="../sonder/dt_bron.html">DeskTop Bronstein</a></span>
</p>
<p id="nav2">
<span id="nav2r"><a id="prev" href="node109.html"><img src="../icons/prev.png" alt="Zurück" /></a><a id="next" href="node111.html"><img src="../icons/next.png" alt="Zurück" /></a></span>
<span id="nav2l"><a class="kap" href="kap_9.html">Differentialgleichungen</a> <a href="node72.html">Partielle Differentialgleichungen</a> <a href="node86.html">Lineare partielle Differentialgleichungen 2.&nbsp;Ordnung</a> <a id="up" href="node95.html">Integrationsmethoden f&#252;r lineare partielle Differentialgleichungen 2.&nbsp;Ordnung</a> </span>
</p>
</div>
<h4><a name="SECTION008223150000000000000" id="SECTION008223150000000000000"></a> <a name="4689"></a> <a name="4690"></a> <a name="4691"></a> <a name="4692"></a> <a name="4693"></a> <a name="4694"></a>
N&auml;herungsmethoden</h4>
<p>Zur L&ouml;sung konkreter Aufgaben mit Hilfe partieller Differentialgleichungen werden oft verschiedene N&auml;herungsverfahren eingesetzt. Dabei ist zwischen analytischen und numerischen Methoden zu unterscheiden.</p>
<dl>
<dt>1.&nbsp;Analytische Methoden</dt>
<dd>Die analytischen Methoden erm&ouml;glichen die Bestimmung angen&auml;herter analytischer Ausdr&uuml;cke f&uuml;r die gesuchte Funktion.</dd>
<dt>2.&nbsp;Numerische Methoden</dt>
<dd>Die <a href="../kap_19/node65.html#kap16.5">numerischen Methoden</a> liefern N&auml;herungswerte der gesuchten Funktion f&uuml;r bestimmte Werte der unabh&auml;ngigen Variablen. Dazu verwendet man folgende Methoden:
<dl>
<dt>a) Methode der finiten Differenzen, kurz Differenzenverfahren:</dt>
<dd>Die Differentialquotienten werden durch Differenzenquotienten ersetzt, so da&szlig; die Differentialgleichung einschlie&szlig;lich Anfangs- und Randbedingungen in ein System von algebraischen Gleichungen umgewandelt wird. Eine lineare Differentialgleichung mit linearen Anfangs- und Randbedingungen wird so zu einem System linearer Gleichungen.</dd>
<dt>b) Methode der finiten Elemente, kurz FEM, f&uuml;r Randwertaufgaben:</dt>
<dd>Der Randwertaufgabe wird eine Variationsaufgabe zugeordnet. Die gesuchte L&ouml;sung wird durch einen Spline-Ansatz approximiert, nachdem das Definitionsgebiet der Randwertaufgabe in regelm&auml;&szlig;ige Teilgebiete zerlegt worden ist. Die Ansatzkoeffizienten werden durch L&ouml;sung einer Extremwertaufgabe bestimmt.</dd>
<dt>c) Randintegralgleichungsmethode f&uuml;r spezielle Randwertaufgaben:</dt>
<dd>Die Randwertaufgabe wird als &auml;quivalentes Integralgleichungsproblem &uuml;ber dem Rand des Definitionsgebietes der Randwertaufgabe formuliert. Dazu werden Integrals&auml;tze der Vektoranalysis, z.B. G<small>REEN</small>sche Formeln, verwendet. Die verbleibenden Randintegrale werden mit Hilfe geeigneter Quadraturformeln numerisch gel&ouml;st.</dd>
</dl>
</dd>
<dt>3.&nbsp;Physikalische Methoden:</dt>
<dd>Numerische L&ouml;sungen von Differentialgleichungen k&ouml;nnen auch auf experimentellem Wege ermittelt werden. Dabei macht man von der Tatsache Gebrauch, da&szlig; recht unterschiedliche physikalische Erscheinungen mit ein und derselben Differentialgleichung beschrieben werden k&ouml;nnen. Um ein gegebenes Problem auf diesem Wege zu l&ouml;sen, wird ein technisches Modell konstruiert, mit dessen Hilfe das gegebene Problem simuliert werden kann und an dem im Experiment Messungen vorgenommen werden, deren Werte die gesuchte Funktion darstellen. Da solche Modelle oft bewu&szlig;t so konstruiert sind, da&szlig; die Parameter in weiten Grenzen eingestellt werden k&ouml;nnen, ist es m&ouml;glich, auch die Differentialgleichung in weiten Gebieten der unabh&auml;ngigen Ver&auml;nderlichen zu untersuchen.</dd>
</dl>
</body>
</html>
