<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy for Linux/x86 (vers 1st September 2004), see www.w3.org" />
<title>Hilfe DeskTop Bronstein</title>
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link id="cssstyle" rel="stylesheet" href="../sonder/bron.css" type="text/css" />
<script src="../sonder/bron.js" type="text/javascript">
</script>
</head>
<body>
<div class="navigation">
<p id="nav1">
<span id="nav1r"><a id="next" href="../sonder/inhalt.html">Inhalt</a> <a id="index" href="../index_os/main.html">Index</a></span>
<span id="nav1l"><a id="dtb" href="../sonder/dt_bron.html">DeskTop Bronstein</a></span>
</p>
</div>
<div class="hilfe">
<h1>HILFE - Informationen zur CD-ROM</h1>
<ul>
<li><a href="#ww">Wissenswertes</a></li>
<li><a href="#suche">Die Suchfunktion</a></li>
<li><a href="#tips">Tips</a></li>
<li><a href="#system">Systemvoraussetzungen</a></li>
<li><a href="#faq">Fragen und Probleme</a></li>
</ul>
<h2 id="ww">Wissenswertes</h2>
<h3>Navigation</h3>
<img class="bsp" alt="" src="abschnitt.png" />
<p>Die beiden Kopfzeilen bieten Ihnen die M&ouml;glichkeit, bequem durch die Mathematik zu navigieren: Durch einen Klick auf die einzelnen Elemente der Navigationsleiste (<span class="nr">3</span>) gelangen Sie zu den &uuml;bergeordneten Themen. Zusammen mit der Abschnitts-&Uuml;berschrift liefert sie die Informationen dar&uuml;ber, wo Sie sich befinden.</p>
<p>Mit den Pfeilen oben rechts (<span class="nr">4</span>)  k&ouml;nnen Sie zwischen den einzelnen Seiten vor und zur&uuml;ck bl&auml;ttern.<br />
Sie bewegen sich dabei nicht in der Liste der bereits besuchten Seiten, wie Sie es mit dem "Zur&uuml;ck"- bzw. "Vor"-Knopf des Browsers tun, sondern bl&auml;ttern wie im Buch.</p>
<p>Ein Klick auf die Schaltfl&auml;che Index (<span class="nr">2</span>)  &ouml;ffnet - bei eingeschalteter <a href="#faq">JavaScript-Unterst&uuml;tzung</a> - das Navigationsfenster und l&auml;dt die Datenbasis f&uuml;r die Suche.</p>
<p>Die Schaltfl&auml;che oben links (<span class="nr">1</span>) f&uuml;hrt sie zur Startseite.</p>
<h3>Navigations-Fenster</h3>
<img class="bsp" alt="" src="index.png" /> 
<p>Bei eingeschalteter <a href="#faq">JavaScript-Unterst&uuml;tzung</a> wird der Index in einem separaten Fenster ge&ouml;ffnet, das zur <span class="begriff">Navigation</span> dient: Ein Klick auf das gew&uuml;nschte Thema im Navigationsfenster stellt die Seite im Hauptfenster dar. Das Navigationsfenster bietet auch die M&ouml;glichkeit, <span class="begriff">Suchbegriffe</span> einzugeben.</p>
<p>Innerhalb des Navigationsfensters k&ouml;nnen Sie schnell zwischen den verschiedenen Zugangsarten - Gesamtindex (<span class="begriff">Index A...Z</span>), nach Kapiteln sortierter Index (<span class="begriff">Index 1...21</span>) und detaillierte Inhaltsverzeichnisse (<span class="begriff">Inhalt</span>) - wechseln.</p>
<h3>Indices</h3>
<img class="bsp" alt="" src="indexaz.png" />
<p>Die beiden alphabetischen Indices sind Stichwortverzeichnisse, die als Sammlung von Verweisen angelegt sind.</p>
<ul>
<li>
<p>W&auml;hlen Sie durch Mausklick ein Kapitel oder den Anfangsbuchstaben des von Ihnen gew&uuml;nschten Stichwortes.</p>
</li>
<li>
<p>Suchen Sie auf der erscheinenden Indexseite den betreffenden Begriff.</p>
</li>
<li>
<p>Anklicken des Begriffes f&uuml;hrt zur gew&uuml;nschten Seite.</p>
</li>
<li>
<p>Innerhalb der Indexseiten erm&ouml;glicht Ihnen die Buchstaben- bzw. Ziffernleiste einen schnellen Wechsel.</p>
</li>
</ul>
<h3>Detailliertes Inhaltsverzeichnis</h3>
<img class="bsp" alt="" src="inhalt.png" />
<p>Hinter <span class="begriff">Inhalt</span> verbirgt sich eine Liste von detaillierten Inhaltsverzeichnissen der einzelnen Kapitel, die als Sammlung von Verweisen angelegt ist.</p>
<ul>
<li>
<p>W&auml;hlen Sie durch Mausklick das Sie interessierende Kapitel.</p>
</li>
<li>
<p>Suchen Sie auf der erscheinenden Inhaltsseite das betreffende Thema.</p>
</li>
<li>
<p>Anklicken des Themas f&uuml;hrt zur gew&uuml;nschten Seite.</p>
</li>
<li style="list-style: none">
<p>Innerhalb der Inhaltsseiten ist &uuml;ber spezielle Leisten ein schneller Wechsel zu einem anderen Kapitel m&ouml;glich.</p>
</li>
</ul>
<h3>Suche</h3>
<img class="bsp" alt="" src="suche.png" />
<p>Der schnellste Weg zur gew&uuml;nschten Information f&uuml;hrt &uuml;ber die Suchfunktion.</p>
<p>Bei den Suchbegriffen wird nicht zwischen <span class="begriff">Gross- und Kleinschreibung</span> unterschieden. <span class="begriff">Umlaute</span> werden direkt eingegeben (Beispiel: h&ouml;lder), ebenso <span class="begriff">Bindestriche</span> (Beispiel: cauchy-schwarz). Franz&ouml;sische <span class="begriff">Akzente</span> m&uuml;ssen weggelassen werden (Beispiel: frechet).</p>
<p>Zwei und mehr Suchbegriffe werden durch Leerschlag getrennt eingegeben. Sie k&ouml;nnen durch UND bzw. ODER (voreingestellt) verkn&uuml;pft werden. Bei mehr als zwei Begriffen gilt die getroffene Wahl f&uuml;r alle Bestandteile.</p>
<p>Sie k&ouml;nnen w&auml;hlen, ob die Suchbegriffe nur als <span class="begriff">Ganzwort</span> (voreingestellt) oder auch als <span class="begriff">Wortbestandteil</span> gefunden werden sollen. Bei mehreren Suchbegriffen bezieht sich die Wahl auf alle Worte.</p>
<p>Ein Klick auf die Schaltfl&auml;che Suchen oder Dr&uuml;cken der ENTER-Taste l&ouml;st den Suchvorgang aus.<br />
Die Titel der gefundenen Seiten werden im selben Fenster unterhalb der Suchmaske angezeigt. Ein Klick auf den von Ihnen gew&uuml;nschten Titel stellt die Seite im Hauptfenster dar.</p>
<h2 id="suche">Die Suchfunktion</h2>
<h3>Datenbasis:</h3>
<p>
Die Suche erfolgt in einer speziell aus dem <span class="begriff">Index</span> des Werkes erzeugten Datenbasis und ist keine Volltextsuche. Angezeigt werden die Titel der gefundenen Seiten; diese sind nicht notwendig mit den Begriffen der Datenbasis identisch.
</p>
<h3>Negation:</h3>
<p>
Zur Begrenzung der Liste der Fundstellen bietet es sich eventuell an, Begriffe ausdr&uuml;cklich auszuschlie&szlig;en, die <span class="begriff">nicht</span> vorkommen sollen. Solche auszuschlie&szlig;enden Suchbegriffe sind durch ein vorangestelltes Ausrufezeichen zu kennzeichnen (Beispiel: fourier !transformation).<br />
Auszuschlie&szlig;ende Suchbegriffe werden - unabh&auml;ngig von der gew&auml;hlten Verkn&uuml;pfung - immer durch UND NICHT mit den anderen Suchbegriffen verbunden.<br />
Mehrere nichtauszuschlie&szlig;ende Suchbegriffe werden bei der Auswertung - nicht bei der Eingabe - in Klammern gesetzt.
</p>
<h3>Beispiele:</h3>
<dl>
<dt>Suche nach Dreiecksbestimmung (Zusammengesetztes Wort)</dt>
<dd>
<p>
Suchbegriffe: dreieck bestimmung<br />
Suchmodus: UND, Teilwort
</p>
</dd>
<dt>Suche nach S&auml;tzen</dt>
<dd>
<p>
Suchbegriffe: satz<br />
Suchmodus: Ganzwort (um "ansatz" etc. auszuschlie&szlig;en)
</p>
</dd>
<dt>Suche nach (Fourier oder Laplace) aber keine Fundstellen, in denen Transformation vorkommt</dt>
<dd>
<p>
Suchbegriffe: fourier laplace !transformation<br />
Suchmodus: ODER
</p>
</dd>
</dl>
<h2 id="tips">Tips</h2>
<ul>
<li>
<p>Sie k&ouml;nnen auch mithilfe der Pfeiltasten der Tastatur durch die einzelnen Seiten des DeskTop Bronstein bl&auml;ttern, wenn diese Funktion von Ihrem Browser unterst&uuml;tzt wird.</p>
</li>
<li>
<p>Sie sollten w&auml;hrend der gesamten Arbeit das Navigationsfenster nicht schlie&szlig;en, sondern durch die Anordnung der beiden Fenster einen schnellen Wechsel zwischen ihnen erm&ouml;glichen. (Windowsbenutzer k&ouml;nnen bei gedr&uuml;ckter ALT-Taste mit der Tabulatortaste zwischen den Fenstern wechseln.) Damit vermeiden Sie das zeitaufwendige Neuladen der Datenbasis f&uuml;r die Suche - und die Wiederholung der Frage, ob Sie <a href="#faq">aktive Inhalte blockieren</a> wollen.</p>
</li>
<li>
<p>Damit das Erscheinungsbild von Text und Formeln auf Ihrem Bildschirm in Abh&auml;ngigkeit von Gr&ouml;&szlig;e und Aufl&ouml;sung des Monitors homogen wirkt, k&ouml;nnen Sie Schriftgr&ouml;&szlig;e - und Schriftart - geeignet w&auml;hlen. Dies geschieht im entsprechenden Men&uuml;punkt des Browsers oder in modernen Browsern besonders einfach &uuml;ber die "+" und "-" -Tasten.</p>
</li>
</ul>
<h2 id="system">Systemvoraussetzungen</h2>
<p>Die CD-ROM &quot;DeskTop Bronstein&quot; ist eine plattformunabh&auml;ngig nutzbare HTML-Struktur, die zur Darstellung Cascading Style Sheets und f&uuml;r die bequeme Navigation &uuml;ber ein zweites Fenster - insbesondere zur Suche - JavaScript verwendet.</p>
<p>
Auch ohne JavaScript-Unterst&uuml;tzung k&ouml;nnen Sie auf alle Informationen zugreifen, nur die Suche im erweiterten Index  und die Navigation &uuml;ber das Navigationsfenster sind nicht m&ouml;glich.
</p>
<h2 id="faq">Fragen und Probleme</h2>
<h3>Sicherheitsfrage wegen geblockter Inhalte, Popupblocker</h3>
<p>Wenn Sie Nutzer des Internet Explorers (mit ServicePack 2) - oder auch des neuesten "Firefox" -  sind und Ihr Browser auf einer hohen Sicherheitsstufe steht, kann es vorkommen, da&szlig; Sie bei der Nutzung der CD-ROM mit der Sicherheitsabfrage konfrontiert werden, ob Sie "geblockte Inhalte" zulassen wollen. (Gemeint sind die JavaScript-Funktionen, die zum &Ouml;ffnen des Navigationsfensters und der Suche verwendet werden.) Nur wenn Sie diese Frage bejahen, k&ouml;nnen Sie die komfortablere Navigation und die Suche verwenden.
</p>
<h3>JavaScript im Browser aktivieren</h3>
<p>Im Firefox (Mozilla, Netscape) finden Sie die Option <span class="menue">JavaScript aktivieren</span> im Men&uuml; <span class="menue">Bearbeiten/Einstellungen/Web-Features</span>.</p>
<!-- scheme:file erlauben -->
</div>
</body>
</html>
