<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy for Linux/x86 (vers 1st September 2004), see www.w3.org" />
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link id="cssstyle" rel="stylesheet" href="../sonder/bron.css" type="text/css" />
<script src="../sonder/bron.js" type="text/javascript"></script>
<title>DeskTop: Suche</title>
</head>
<body>
<h1 class="verz">Hilfe zur Suche</h1>
<p>Bei den Suchbegriffen wird nicht zwischen <span class="begriff">Gross- und Kleinschreibung</span> unterschieden. <span class="begriff">Umlaute</span> werden direkt eingegeben (Beispiel: h&ouml;lder), ebenso <span class="begriff">Bindestriche</span> (Beispiel: cauchy-schwarz). Franz&ouml;sische <span class="begriff">Akzente</span> m&uuml;ssen weggelassen werden (Beispiel: frechet).</p>
<p>Zwei und mehr Suchbegriffe werden durch Leerschlag getrennt eingegeben. Sie k&ouml;nnen durch UND bzw. ODER (voreingestellt) verkn&uuml;pft werden. Bei mehr als zwei Begriffen gilt die getroffene Wahl f&uuml;r alle Bestandteile.</p>
<p>Sie k&ouml;nnen w&auml;hlen, ob die Suchbegriffe nur als <span class="begriff">Ganzwort</span> (voreingestellt) oder auch als <span class="begriff">Wortbestandteil</span> gefunden werden sollen. Bei mehreren Suchbegriffen bezieht sich die Wahl auf alle Worte.</p>
<p>Ein Klick auf die Schaltfl&auml;che Suchen oder Dr&uuml;cken der ENTER-Taste l&ouml;st den Suchvorgang aus.<br />
Die Titel der gefundenen Seiten werden im selben Fenster unterhalb der Suchmaske angezeigt. Ein Klick auf den von Ihnen gew&uuml;nschten Titel stellt die Seite im Hauptfenster dar.</p>
<p>Das Navigationsfenster mit der Suchmaske und den Fundstellen bleibt im Hintergrund erhalten. Durch Klicken auf einen beliebigen Punkt in diesem Fenster kommt es erneut in den Vordergund und erm&ouml;glicht die Auswahl einer weiteren Fundstelle oder eine neue Suchanfrage. Sie sollten w&auml;hrend der gesamten Arbeit das Navigationsfenster nicht schlie&szlig;en, sondern durch die Anordnung der beiden Fenster einen schnellen Wechsel zwischen ihnen erm&ouml;glichen.</p>
<p>Innerhalb des Navigationsfensters k&ouml;nnen Sie schnell zwischen der Suchmaske, dem Index und den detaillierten Inhaltsverzeichnissen der einzelnen Kapitel (Themen) wechseln.<br />
Das &Ouml;ffnen des Navigationsfensters vom Hauptfenster aus (durch Klicken auf die Schaltfl&auml;che INDEX in der Navigationsleiste) bewirkt dagegen das zeitaufwendige Neuladen der Datenbasis f&uuml;r die Suche.</p>
<h2 class="verz">Datenbasis:</h2>
Die Suche erfolgt in einer speziell aus dem <span class="begriff">Index</span> des Werkes erzeugten Datenbasis und ist keine Volltextsuche. Angezeigt werden die Titel der gefundenen Seiten; diese sind nicht notwendig mit den Begriffen der Datenbasis identisch.</p>
<h2 class="verz">Negation:</h2>
Zur Begrenzung der Liste der Fundstellen bietet es sich eventuell an, Begriffe ausdr&uuml;cklich auszuschlie&szlig;en, die <span class="begriff">nicht</span> vorkommen sollen. Solche auszuschlie&szlig;enden Suchbegriffe sind durch ein vorangestelltes Ausrufezeichen zu kennzeichnen (Beispiel: fourier !transformation).<br />
Auszuschlie&szlig;ende Suchbegriffe werden - unabh&auml;ngig von der gew&auml;hlten Verkn&uuml;pfung - immer durch UND NICHT mit den anderen Suchbegriffen verbunden.<br />
Mehrere nichtauszuschlie&szlig;ende Suchbegriffe werden bei der Auswertung - nicht bei der Eingabe - in Klammern gesetzt.</p>
<h2 class="verz">Weitere Beispiele:</h2>
<dl>
<dt>Suche nach Dreiecksbestimmung (Zusammengesetztes Wort)</dt>
<dd>Suchbegriffe: dreieck bestimmung<br />
Suchmodus: UND, Teilwort</dd>
<dt>Suche nach S&auml;tzen</dt>
<dd>Suchbegriffe: satz<br />
Suchmodus: Ganzwort (um "ansatz" etc. auszuschlie&szlig;en)</dd>
<dt>Suche nach (Fourier oder Laplace) aber keine Fundstellen, in denen Transformation vorkommt</dt>
<dd>Suchbegriffe: fourier laplace !transformation<br />
Suchmodus: ODER</dd>
</dl>
<p><a href="h.html" onmouseover="window.status='DeskTop-Hilfen: &Uuml;bersicht';return true;" onmouseout="window.status=window.defaultStatus;" target="cliXX">Allgemeine Hilfe</a></p>
</body>
</html>
