<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Impressum</title>
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta http-equiv="Content-Style-Type" content="text/css" />
<link id="cssstyle" rel="STYLESHEET" href="../sonder/bron.css" type="text/css" />
<script src="../sonder/bron.js" type="text/javascript"></script>
</head>
<body>
<div class="navigation">
<p id="nav1">
<span id="nav1r"><a href="../sonder/inhalt.html">Inhalt</a> <a id="index" href="../index_os/main.html">Index</a></span>
<span id="nav1l"><a id="dtb" href="../sonder/dt_bron.html">DeskTop Bronstein</a></span>
</p>
</div>
<div class="hilfe">
<h1>Impressum von &quot;DeskTop Bronstein&quot;</h1>
<h2>Der Verlag Harri Deutsch</h2>
<p>Bei der Gr&#252;ndung des Verlags Harri Deutsch im Jahre 1961 wurden die
langj&#228;hrigen Erfahrungen aus der Fachbuchhandlung Harri Deutsch an der
Universit&#228;t Frankfurt in die Verlagskonzeption eingebracht.
Aus der N&#228;he zur Universit&#228;t ergaben sich insbesondere die
Programmschwerpunkte in den Gebieten Naturwissenschaften, Mathematik und
Technik.
</p><p>
Dem Selbstverst&#228;ndnis des Verlags entsprechend, werden seit Bestehen
didaktisch ausgereifte und preisg&#252;nstige Lehrb&#252;cher und
Nachschlagewerke mit hohem Informationsgehalt f&#252;r Studenten, Dozenten und
Praktiker dieser F&#228;cher bereitgestellt.
Mit gro&#223;em Erfolg arbeitete der Verlag Harri Deutsch in seiner
Anfangsphase mit ostdeutschen und osteurop&#228;ischen Verlagen zusammen. So
konnte renommierte Fachliteratur durch Lizenzausgaben einem wesentlich
breiteren Interessentenkreis zug&#228;nglich gemacht werden.
</p><p>
Inzwischen wurden wichtige Teile des Verlagsprogramms v&#246;llig
&#252;berarbeitet und um neue Titel erweitert. Mit dem Einsatz
zukunftsweisender Technik konnte das Verlagskonzept auch unter ver&#228;nderten
Rahmenbedingungen bewahrt werden. Konsequent wird die Verlagsproduktion
entsprechend den Erfordernissen des elektronischen Zeitalters ausgebaut.
Gro&#223;e Teile des Programms sind am Niveau von Fachhochschule und
Universit&#228;t orientiert, die Bandbreite reicht jedoch von
popul&#228;rwissenschaftlichen Darstellungen &#252;ber Literatur f&#252;r die
Mittel- und Oberstufe an Gymnasien bis hin zu Forschungsmonographien.
</p><p>
Aktuelle Informationen zu den Produkten des Verlags Harri Deutsch finden Sie
unter <a href="http://www.harri-deutsch.de/verlag/">www.harri-deutsch.de/verlag/</a></p>
<p>Wenn Sie k&#252;nftig aktuelle <a href=
"mailto:hades@harri-deutsch.de?subject=Verlags-Info">Verlagsinformationen per
E-Mail</a> w&#252;nschen, schicken Sie uns bitte eine E-Mail mit dem Subject
&quot;Verlags-Info&quot;.</p>
<h2><a name="hades">Das Label hades</a></h2>
<p>Unter dem Markenzeichen <span class="hades">ha</span>rri <span class="hades">d</span>eutsch <span class="hades">e</span>lectronic <span class="hades">s</span>cience - kurz: <span class="hades">hades</span> - hat der Verlag seine Aktivit&auml;ten im Bereich des elektronischen Publizierens geb&uuml;ndelt.</p>
<p>Die ersten Projekte unter dem Label &quot;hades&quot; sind die Reihen DeskTop und cliXX, in denen elektronische Nachschlagewerke (DeskTop) und Lehrg&auml;nge (cliXX) f&uuml;r Sch&uuml;ler, Studenten, Lehrer, Wissenschaftler und Praktiker entwickelt werden.</p>
<p>Dabei werden HTML-Strukturen verwendet, weil: </p>
<ul>
<li>sie on- und offline (CD-ROM) nutzbar sind</li>
<li>sie plattformunabh&auml;ngig laufen</li>
<li>sie die Einbindung multimedialer Komponenten erlauben und</li>
<li>die entsprechenden Browser den Nutzern sowohl in lokalen Netzen als auch zu Hause vertraut sind.</li>
</ul>
<p>Aktuelle Informationen finden Sie bei <a href="http://www.harri-deutsch.de/verlag/reihen/hades.htm">hades online</a>.</p>
<h2>Netzlizenzen</h2>
<p>
Neben der CD-ROM f&uuml;r den Individualnutzer bietet der Verlag Harri Deutsch
Institutionen der Lehre und Forschung wie auch Firmen Mehrplatzlizenzen und Online-Lizenzen
in verschiedenen Konfigurationen an.
</p>
<p>Wenn Sie an Netzwerklizenzen unserer Produkte interessiert sind, wenden Sie sich bitte direkt an den <a href="mailto:verlag@harri-deutsch.de?subject=Netzwerklizenz">Verlag</a>.</p>
<h2>Anmerkungen zum Copyright</h2>
<p><b>&#169; 2005 by Wissenschaftlicher Verlag Harri Deutsch GmbH.</b></p>
<p>Dieses Produkt ist in seiner Gesamtstruktur und in seinen Teilen (Texte,
Tabellen, Bilder, Movies, Programme) urheberrechtlich gesch&#252;tzt.
Alle Rechte vorbehalten. All copyrights reserved.
Der Erwerb dieses Produktes berechtigt nicht zum kommerziellen Verleih.
Vervielf&#228;ltigung, Vermietung, Auff&#252;hrung, &#196;nderung sind nur
mit ausdr&#252;cklicher und schriftlicher Genehmigung des Verlags erlaubt.
Der Verlag gestattet allen Nutzern, die diese CD-ROM k&#228;uflich erworben
haben, das enthaltene Material zu Lehr-, Ausbildungs- und Vortragszwecken zu
nutzen.
Nicht gestattet ist es dagegen, die Inhalte in ein Netz - welcher Art auch
immer - einzuspeisen, es also mehreren Nutzern an verschiedenen Rechnern zur
gleichen Zeit zur Verf&#252;gung zu stellen.
Im Material enthaltene Copyright-Informationen d&#252;rfen nicht
ver&#228;ndert oder weggelassen werden.
Der Inhalt dieses Produkts wurde sorgf&#228;ltig erarbeitet. Dennoch
&#252;bernehmen Autor und Verlag f&#252;r die Richtigkeit von Angaben,
Hinweisen und Ratschl&#228;gen sowie f&#252;r inhaltliche Fehler keine
Haftung.</p>
</div>
</body>
</html>
